ykikiwert/stm32-esp01-sensor-WeChat_Mini_Program/01stm32/hardware/src/led.c
//单片机头文件
#include "stm32f10x.h"

//硬件驱动
#include "led.h"

LED_INFO led_info = {0};


/*
************************************************************
*	函数名称：	Led_Init
*
*	函数功能：	蜂鸣器初始化
*
*	入口参数：	无
*
*	返回参数：	无
*
*	说明：		
************************************************************
*/
void Led_Init(void)
{

	GPIO_InitTypeDef gpio_initstruct;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);		//打开GPIOC的时钟
	
	gpio_initstruct.GPIO_Mode = GPIO_Mode_Out_PP;				    //设置为输出
	gpio_initstruct.GPIO_Pin = GPIO_Pin_13;						      //将初始化的Pin脚
	gpio_initstruct.GPIO_Speed = GPIO_Speed_50MHz;				  //可承载的最大频率
	
	GPIO_Init(GPIOC, &gpio_initstruct);							        //初始化GPIO
	
	Led_Set(LED_OFF);										

}

void GPIOInit(void)
{
	GPIO_InitTypeDef gpio_initstruct;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);		//打开GPIOB的时钟
	
	gpio_initstruct.GPIO_Mode = GPIO_Mode_Out_PP;				//设置为输出
	gpio_initstruct.GPIO_Pin = GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14;						//将初始化的Pin脚
	gpio_initstruct.GPIO_Speed = GPIO_Speed_50MHz;				//可承载的最大频率
	
	GPIO_Init(GPIOB, &gpio_initstruct);	
  GPIO_SetBits(GPIOB,GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14);
	
	  
}
/*
************************************************************
*	函数名称：	Led_Set
*
*	函数功能：	开关灯控制
*
*	入口参数：	status：开关灯
*
*	返回参数：	无
*
*	说明：		开-LED_ON		关-LED_OFF
************************************************************
*/
void Led_Set(_Bool status)
{
	
	GPIO_WriteBit(GPIOC, GPIO_Pin_13, status == LED_ON ? Bit_RESET : Bit_SET);		//如果status等于LED_ON，则返回Bit_SET，否则返回Bit_RESET
	
	led_info.Led_Status = status;

}
